Revit 2027 API
ParameterTypeId.RoofConstraintOffsetParam Property
 "Level Offset"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RoofConstraintOffsetParam { get; }
Public Shared ReadOnly Property RoofConstraintOffsetParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RoofConstraintOffsetParam {
	ForgeTypeId^ get ();
}
static member RoofConstraintOffsetParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace